app/admin/dashboard.rb

    columns do
      column do
        panel "User Partner Statistics" do
          if User.any?
---
SELECT 1 AS one FROM "users" LIMIT ?  [["LIMIT", 1]]

    columns do
      column do
        panel "Restaurant Orders" do
          data = Restaurant.all.joins(:orders)
                            .select('restaurants.*, COUNT(orders.id) AS orders_count')
                            .group('restaurants.id')
                            .order('orders_count DESC')
                            .limit(5)
                            .map { |r| [r.name, r.orders_count] }.to_h
---
SELECT restaurants.*, COUNT(orders.id) AS orders_count FROM "restaurants" INNER JOIN "orders" ON "orders"."restaurant_id" = "restaurants"."id" GROUP BY "restaurants"."id" ORDER BY orders_count DESC LIMIT ?  [["LIMIT", 5]]


      column do
        panel "Top Restaurants by Orders" do
          restaurants = Restaurant.joins(:orders)
                                  .select('restaurants.*, COUNT(orders.id) AS orders_count')
                                  .group('restaurants.id')
                                  .order('orders_count DESC')
                                  .limit(5)
---
SELECT restaurants.*, COUNT(orders.id) AS orders_count FROM "restaurants" INNER JOIN "orders" ON "orders"."restaurant_id" = "restaurants"."id" GROUP BY "restaurants"."id" ORDER BY orders_count DESC LIMIT ?  [["LIMIT", 5]]

    def most_frequent_customer_for(user, status)
      frequent_customer = user.partner_orders.where(partner_status: status)
                                            .group(:user_id)
                                            .order('COUNT(user_id) DESC')
                                            .first&.user
      frequent_customer.present? ? frequent_customer.username : "N/A"
    end
end






  # Third Row: Detailed User and Menu Item Stats
  columns do
    column do
      panel "Top 5 Users by Orders" do
        top_users = User.joins(:orders)
                        .select('users.*, COUNT(orders.id) as orders_count')
                        .group('users.id')
                        .order('orders_count DESC')
                        .limit(5)
---
SELECT users.*, COUNT(orders.id) as orders_count FROM "users" INNER JOIN "orders" ON "orders"."user_id" = "users"."id" GROUP BY "users"."id" ORDER BY orders_count DESC LIMIT ?  [["LIMIT", 5]]


      column do
        panel "Menu Items by Restaurant" do
          table_for MenuItem.joins(:restaurant).group('restaurants.name') do
---
SELECT "menu_items".* FROM "menu_items" INNER JOIN "restaurants" ON "restaurants"."id" = "menu_items"."restaurant_id" GROUP BY "restaurants"."name"

    columns do
      column do
        panel "Recent Orders" do
          table_for Order.order('created_at desc').limit(10) do
---
SELECT "orders".* FROM "orders" ORDER BY created_at desc LIMIT ?  [["LIMIT", 10]]


        column do
          panel "Recent Partner Orders" do
            table_for PartnerOrder.order('created_at desc').limit(10) do
---
SELECT "partner_orders".* FROM "partner_orders" ORDER BY created_at desc LIMIT ?  [["LIMIT", 10]]


      column do
        panel "Daily Order Status" do
          today_orders = Order.where(created_at: Time.zone.today.all_day)
                              .or(Order.where(updated_at: Time.zone.today.all_day))
                              .group(:status)
                              .count
---
SELECT COUNT(*) AS "count_all", "orders"."status" AS "orders_status" FROM "orders" WHERE ("orders"."created_at" BETWEEN ? AND ? OR "orders"."updated_at" BETWEEN ? AND ?) GROUP BY "orders"."status"  [["created_at", "2024-01-18 00:00:00"], ["created_at", "2024-01-18 23:59:59.999999"], ["updated_at", "2024-01-18 00:00:00"], ["updated_at", "2024-01-18 23:59:59.999999"]]


    # Fifth Row: Overall Order Stats
    panel "Order Stats" do
      stats_data = Order.group(:status).count
---
SELECT COUNT(*) AS "count_all", "orders"."status" AS "orders_status" FROM "orders" GROUP BY "orders"."status"